adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001_bitfields.h
/* Bit 0 : Priority register for RAM AHB slave 0 */
#define AMLI_RAMPRI_CPU_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define AMLI_RAMPRI_CPU_RAM0_Msk (0x1UL << AMLI_RAMPRI_CPU_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define AMLI_RAMPRI_CPU_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CPU_RAM0_Pri1 (1UL) /*!< Priority 1 */

/* Register: AMLI_RAMPRI_PERI */
/* Description: AHB bus master priority register for periperals */

/* Bit 1 : Priority register for RAM AHB slave 1 */
#define AMLI_RAMPRI_PERI_RAM1_Pos (1UL) /*!< Position of RAM1 field. */
#define AMLI_RAMPRI_PERI_RAM1_Msk (0x1UL << AMLI_RAMPRI_PERI_RAM1_Pos) /*!< Bit mask of RAM1 field. */
#define AMLI_RAMPRI_PERI_RAM1_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_PERI_RAM1_Pri1 (1UL) /*!< Priority 1 */

/* Bit 0 : Priority register for RAM AHB slave 0 */
#define AMLI_RAMPRI_PERI_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define AMLI_RAMPRI_PERI_RAM0_Msk (0x1UL << AMLI_RAMPRI_PERI_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define AMLI_RAMPRI_PERI_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_PERI_RAM0_Pri1 (1UL) /*!< Priority 1 */

/* Register: AMLI_RAMPRI_USB */
/* Description: AHB bus master priority register for USB */

/* Bit 1 : Priority register for RAM AHB slave 1 */
#define AMLI_RAMPRI_USB_RAM1_Pos (1UL) /*!< Position of RAM1 field. */
#define AMLI_RAMPRI_USB_RAM1_Msk (0x1UL << AMLI_RAMPRI_USB_RAM1_Pos) /*!< Bit mask of RAM1 field. */
#define AMLI_RAMPRI_USB_RAM1_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_USB_RAM1_Pri1 (1UL) /*!< Priority 1 */

/* Bit 0 : Priority register for RAM AHB slave 0 */
#define AMLI_RAMPRI_USB_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define AMLI_RAMPRI_USB_RAM0_Msk (0x1UL << AMLI_RAMPRI_USB_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define AMLI_RAMPRI_USB_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_USB_RAM0_Pri1 (1UL) /*!< Priority 1 */

/* Register: AMLI_RAMPRI_CTRLAP */
/* Description: AHB bus master priority register for CTRL-AP */

/* Bit 1 : Priority register for RAM AHB slave 1 */
#define AMLI_RAMPRI_CTRLAP_RAM1_Pos (1UL) /*!< Position of RAM1 field. */
#define AMLI_RAMPRI_CTRLAP_RAM1_Msk (0x1UL << AMLI_RAMPRI_CTRLAP_RAM1_Pos) /*!< Bit mask of RAM1 field. */
#define AMLI_RAMPRI_CTRLAP_RAM1_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CTRLAP_RAM1_Pri1 (1UL) /*!< Priority 1 */

/* Bit 0 : Priority register for RAM AHB slave 0 */
#define AMLI_RAMPRI_CTRLAP_RAM0_Pos (0UL) /*!< Position of RAM0 field. */
#define AMLI_RAMPRI_CTRLAP_RAM0_Msk (0x1UL << AMLI_RAMPRI_CTRLAP_RAM0_Pos) /*!< Bit mask of RAM0 field. */
#define AMLI_RAMPRI_CTRLAP_RAM0_Pri0 (0UL) /*!< Priority 0 */
#define AMLI_RAMPRI_CTRLAP_RAM0_Pri1 (1UL) /*!< Priority 1 */


/* Peripheral: BPROT */
/* Description: Block Protect */

/* Register: BPROT_CONFIG0 */
/* Description: Block protect configuration register 0 */

/* Bit 31 : Enable protection for region 31. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION31_Pos (31UL) /*!< Position of REGION31 field. */
#define BPROT_CONFIG0_REGION31_Msk (0x1UL << BPROT_CONFIG0_REGION31_Pos) /*!< Bit mask of REGION31 field. */
#define BPROT_CONFIG0_REGION31_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION31_Enabled (1UL) /*!< Protection enabled */

/* Bit 30 : Enable protection for region 30. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION30_Pos (30UL) /*!< Position of REGION30 field. */
#define BPROT_CONFIG0_REGION30_Msk (0x1UL << BPROT_CONFIG0_REGION30_Pos) /*!< Bit mask of REGION30 field. */
#define BPROT_CONFIG0_REGION30_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION30_Enabled (1UL) /*!< Protection enabled */

/* Bit 29 : Enable protection for region 29. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION29_Pos (29UL) /*!< Position of REGION29 field. */
#define BPROT_CONFIG0_REGION29_Msk (0x1UL << BPROT_CONFIG0_REGION29_Pos) /*!< Bit mask of REGION29 field. */
#define BPROT_CONFIG0_REGION29_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION29_Enabled (1UL) /*!< Protection enabled */

/* Bit 28 : Enable protection for region 28. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION28_Pos (28UL) /*!< Position of REGION28 field. */
#define BPROT_CONFIG0_REGION28_Msk (0x1UL << BPROT_CONFIG0_REGION28_Pos) /*!< Bit mask of REGION28 field. */
#define BPROT_CONFIG0_REGION28_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION28_Enabled (1UL) /*!< Protection enabled */

/* Bit 27 : Enable protection for region 27. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION27_Pos (27UL) /*!< Position of REGION27 field. */
#define BPROT_CONFIG0_REGION27_Msk (0x1UL << BPROT_CONFIG0_REGION27_Pos) /*!< Bit mask of REGION27 field. */
#define BPROT_CONFIG0_REGION27_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION27_Enabled (1UL) /*!< Protection enabled */

/* Bit 26 : Enable protection for region 26. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION26_Pos (26UL) /*!< Position of REGION26 field. */
#define BPROT_CONFIG0_REGION26_Msk (0x1UL << BPROT_CONFIG0_REGION26_Pos) /*!< Bit mask of REGION26 field. */
#define BPROT_CONFIG0_REGION26_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION26_Enabled (1UL) /*!< Protection enabled */

/* Bit 25 : Enable protection for region 25. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION25_Pos (25UL) /*!< Position of REGION25 field. */
#define BPROT_CONFIG0_REGION25_Msk (0x1UL << BPROT_CONFIG0_REGION25_Pos) /*!< Bit mask of REGION25 field. */
#define BPROT_CONFIG0_REGION25_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION25_Enabled (1UL) /*!< Protection enabled */

/* Bit 24 : Enable protection for region 24. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION24_Pos (24UL) /*!< Position of REGION24 field. */
#define BPROT_CONFIG0_REGION24_Msk (0x1UL << BPROT_CONFIG0_REGION24_Pos) /*!< Bit mask of REGION24 field. */
#define BPROT_CONFIG0_REGION24_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION24_Enabled (1UL) /*!< Protection enabled */

/* Bit 23 : Enable protection for region 23. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION23_Pos (23UL) /*!< Position of REGION23 field. */
#define BPROT_CONFIG0_REGION23_Msk (0x1UL << BPROT_CONFIG0_REGION23_Pos) /*!< Bit mask of REGION23 field. */
#define BPROT_CONFIG0_REGION23_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION23_Enabled (1UL) /*!< Protection enabled */

/* Bit 22 : Enable protection for region 22. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION22_Pos (22UL) /*!< Position of REGION22 field. */
#define BPROT_CONFIG0_REGION22_Msk (0x1UL << BPROT_CONFIG0_REGION22_Pos) /*!< Bit mask of REGION22 field. */
#define BPROT_CONFIG0_REGION22_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION22_Enabled (1UL) /*!< Protection enabled */

/* Bit 21 : Enable protection for region 21. Write '0' has no effect. */
#define BPROT_CONFIG0_REGION21_Pos (21UL) /*!< Position of REGION21 field. */
#define BPROT_CONFIG0_REGION21_Msk (0x1UL << BPROT_CONFIG0_REGION21_Pos) /*!< Bit mask of REGION21 field. */
#define BPROT_CONFIG0_REGION21_Disabled (0UL) /*!< Protection disabled */
#define BPROT_CONFIG0_REGION21_Enabled (1UL) /*!< Protection enabled */

