adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001_bitfields.h
/* Bit 1 : Write '1' to disable interrupt for event IN[1] */
#define GPIOTE_INTENCLR_IN1_Pos (1UL) /*!< Position of IN1 field. */
#define GPIOTE_INTENCLR_IN1_Msk (0x1UL << GPIOTE_INTENCLR_IN1_Pos) /*!< Bit mask of IN1 field. */
#define GPIOTE_INTENCLR_IN1_Disabled (0UL) /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN1_Enabled (1UL) /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN1_Clear (1UL) /*!< Disable */

/* Bit 0 : Write '1' to disable interrupt for event IN[0] */
#define GPIOTE_INTENCLR_IN0_Pos (0UL) /*!< Position of IN0 field. */
#define GPIOTE_INTENCLR_IN0_Msk (0x1UL << GPIOTE_INTENCLR_IN0_Pos) /*!< Bit mask of IN0 field. */
#define GPIOTE_INTENCLR_IN0_Disabled (0UL) /*!< Read: Disabled */
#define GPIOTE_INTENCLR_IN0_Enabled (1UL) /*!< Read: Enabled */
#define GPIOTE_INTENCLR_IN0_Clear (1UL) /*!< Disable */

/* Register: GPIOTE_CONFIG */
/* Description: Description collection: Configuration for OUT[n], SET[n], and CLR[n] tasks and IN[n] event */

/* Bit 20 : When in task mode: Initial value of the output when the GPIOTE channel is configured. When in event mode: No effect. */
#define GPIOTE_CONFIG_OUTINIT_Pos (20UL) /*!< Position of OUTINIT field. */
#define GPIOTE_CONFIG_OUTINIT_Msk (0x1UL << GPIOTE_CONFIG_OUTINIT_Pos) /*!< Bit mask of OUTINIT field. */
#define GPIOTE_CONFIG_OUTINIT_Low (0UL) /*!< Task mode: Initial value of pin before task triggering is low */
#define GPIOTE_CONFIG_OUTINIT_High (1UL) /*!< Task mode: Initial value of pin before task triggering is high */

/* Bits 17..16 : When In task mode: Operation to be performed on output when OUT[n] task is triggered. When In event mode: Operation on input that shall trigger IN[n] event. */
#define GPIOTE_CONFIG_POLARITY_Pos (16UL) /*!< Position of POLARITY field. */
#define GPIOTE_CONFIG_POLARITY_Msk (0x3UL << GPIOTE_CONFIG_POLARITY_Pos) /*!< Bit mask of POLARITY field. */
#define GPIOTE_CONFIG_POLARITY_None (0UL) /*!< Task mode: No effect on pin from OUT[n] task. Event mode: no IN[n] event generated on pin activity. */
#define GPIOTE_CONFIG_POLARITY_LoToHi (1UL) /*!< Task mode: Set pin from OUT[n] task. Event mode: Generate IN[n] event when rising edge on pin. */
#define GPIOTE_CONFIG_POLARITY_HiToLo (2UL) /*!< Task mode: Clear pin from OUT[n] task. Event mode: Generate IN[n] event when falling edge on pin. */
#define GPIOTE_CONFIG_POLARITY_Toggle (3UL) /*!< Task mode: Toggle pin from OUT[n]. Event mode: Generate IN[n] when any change on pin. */

/* Bit 13 : Port number */
#define GPIOTE_CONFIG_PORT_Pos (13UL) /*!< Position of PORT field. */
#define GPIOTE_CONFIG_PORT_Msk (0x1UL << GPIOTE_CONFIG_PORT_Pos) /*!< Bit mask of PORT field. */

/* Bits 12..8 : GPIO number associated with SET[n], CLR[n], and OUT[n] tasks and IN[n] event */
#define GPIOTE_CONFIG_PSEL_Pos (8UL) /*!< Position of PSEL field. */
#define GPIOTE_CONFIG_PSEL_Msk (0x1FUL << GPIOTE_CONFIG_PSEL_Pos) /*!< Bit mask of PSEL field. */

/* Bits 1..0 : Mode */
#define GPIOTE_CONFIG_MODE_Pos (0UL) /*!< Position of MODE field. */
#define GPIOTE_CONFIG_MODE_Msk (0x3UL << GPIOTE_CONFIG_MODE_Pos) /*!< Bit mask of MODE field. */
#define GPIOTE_CONFIG_MODE_Disabled (0UL) /*!< Disabled. Pin specified by PSEL will not be acquired by the GPIOTE module. */
#define GPIOTE_CONFIG_MODE_Event (1UL) /*!< Event mode */
#define GPIOTE_CONFIG_MODE_Task (3UL) /*!< Task mode */

/* Register: GPIOTE_DEBOUNCE */
/* Description: Description collection: Debounce mode for GPIOTE channel n */

/* Bit 0 : Mode */
#define GPIOTE_DEBOUNCE_MODE_Pos (0UL) /*!< Position of MODE field. */
#define GPIOTE_DEBOUNCE_MODE_Msk (0x1UL << GPIOTE_DEBOUNCE_MODE_Pos) /*!< Bit mask of MODE field. */
#define GPIOTE_DEBOUNCE_MODE_Mode0 (0UL) /*!< Mode 0: nRF52 debounce method */
#define GPIOTE_DEBOUNCE_MODE_Mode1 (1UL) /*!< Mode 1: nRF51 legacy debounce method */

/* Register: GPIOTE_TASKS_PCPPEN_LOW */
/* Description: Description cluster: Configure PCP[n] requests to have lowest possible penalty */

/* Bit 0 : Configure PCP[n] requests to have lowest possible penalty */
#define GPIOTE_TASKS_PCPPEN_LOW_LOW_Pos (0UL) /*!< Position of LOW field. */
#define GPIOTE_TASKS_PCPPEN_LOW_LOW_Msk (0x1UL << GPIOTE_TASKS_PCPPEN_LOW_LOW_Pos) /*!< Bit mask of LOW field. */
#define GPIOTE_TASKS_PCPPEN_LOW_LOW_Trigger (1UL) /*!< Trigger task */

/* Register: GPIOTE_TASKS_PCPPEN_HIGH */
/* Description: Description cluster: Configure PCP[n] requests to have highest possible penalty */

/* Bit 0 : Configure PCP[n] requests to have highest possible penalty */
#define GPIOTE_TASKS_PCPPEN_HIGH_HIGH_Pos (0UL) /*!< Position of HIGH field. */
#define GPIOTE_TASKS_PCPPEN_HIGH_HIGH_Msk (0x1UL << GPIOTE_TASKS_PCPPEN_HIGH_HIGH_Pos) /*!< Bit mask of HIGH field. */
#define GPIOTE_TASKS_PCPPEN_HIGH_HIGH_Trigger (1UL) /*!< Trigger task */

/* Register: GPIOTE_SUBSCRIBE_PCPPEN_LOW */
/* Description: Description cluster: Subscribe configuration for task PCPPEN[n].LOW */

/* Bit 31 :   */
#define GPIOTE_SUBSCRIBE_PCPPEN_LOW_EN_Pos (31UL) /*!< Position of EN field. */
#define GPIOTE_SUBSCRIBE_PCPPEN_LOW_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_PCPPEN_LOW_EN_Pos) /*!< Bit mask of EN field. */
#define GPIOTE_SUBSCRIBE_PCPPEN_LOW_EN_Disabled (0UL) /*!< Disable subscription */
#define GPIOTE_SUBSCRIBE_PCPPEN_LOW_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task PCPPEN[n].LOW will subscribe to */
#define GPIOTE_SUBSCRIBE_PCPPEN_LOW_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define GPIOTE_SUBSCRIBE_PCPPEN_LOW_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_PCPPEN_LOW_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: GPIOTE_SUBSCRIBE_PCPPEN_HIGH */
/* Description: Description cluster: Subscribe configuration for task PCPPEN[n].HIGH */

/* Bit 31 :   */
#define GPIOTE_SUBSCRIBE_PCPPEN_HIGH_EN_Pos (31UL) /*!< Position of EN field. */
#define GPIOTE_SUBSCRIBE_PCPPEN_HIGH_EN_Msk (0x1UL << GPIOTE_SUBSCRIBE_PCPPEN_HIGH_EN_Pos) /*!< Bit mask of EN field. */
#define GPIOTE_SUBSCRIBE_PCPPEN_HIGH_EN_Disabled (0UL) /*!< Disable subscription */
#define GPIOTE_SUBSCRIBE_PCPPEN_HIGH_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task PCPPEN[n].HIGH will subscribe to */
#define GPIOTE_SUBSCRIBE_PCPPEN_HIGH_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define GPIOTE_SUBSCRIBE_PCPPEN_HIGH_CHIDX_Msk (0xFFUL << GPIOTE_SUBSCRIBE_PCPPEN_HIGH_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: GPIOTE_POWER */
/* Description: Peripheral power control */

/* Bit 0 : Peripheral power control. The peripheral and its registers will be reset to its initial state by switching the peripheral off and then back on again. */
#define GPIOTE_POWER_POWER_Pos (0UL) /*!< Position of POWER field. */
#define GPIOTE_POWER_POWER_Msk (0x1UL << GPIOTE_POWER_POWER_Pos) /*!< Bit mask of POWER field. */
#define GPIOTE_POWER_POWER_Disabled (0UL) /*!< Peripheral is powered off */
#define GPIOTE_POWER_POWER_Enabled (1UL) /*!< Peripheral is powered on */


/* Peripheral: NVMC */
/* Description: Non Volatile Memory Controller */

/* Register: NVMC_READY */
/* Description: Ready flag */

/* Bit 0 : NVMC is ready or busy */
#define NVMC_READY_READY_Pos (0UL) /*!< Position of READY field. */
#define NVMC_READY_READY_Msk (0x1UL << NVMC_READY_READY_Pos) /*!< Bit mask of READY field. */
#define NVMC_READY_READY_Busy (0UL) /*!< NVMC is busy (on-going write or erase operation) */
#define NVMC_READY_READY_Ready (1UL) /*!< NVMC is ready */

/* Register: NVMC_READYNEXT */
/* Description: Ready flag */

/* Bit 0 : NVMC can accept a new write operation */
#define NVMC_READYNEXT_READYNEXT_Pos (0UL) /*!< Position of READYNEXT field. */
#define NVMC_READYNEXT_READYNEXT_Msk (0x1UL << NVMC_READYNEXT_READYNEXT_Pos) /*!< Bit mask of READYNEXT field. */
#define NVMC_READYNEXT_READYNEXT_Busy (0UL) /*!< NVMC cannot accept any write operation */
#define NVMC_READYNEXT_READYNEXT_Ready (1UL) /*!< NVMC is ready */

/* Register: NVMC_TESTWORDSTATE */
/* Description: Test word status */

