adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001_bitfields.h
/* Bits 1..0 : State of the least significant bit in the test word */
#define NVMC_TESTWORDSTATE_STATE_Pos (0UL) /*!< Position of STATE field. */
#define NVMC_TESTWORDSTATE_STATE_Msk (0x3UL << NVMC_TESTWORDSTATE_STATE_Pos) /*!< Bit mask of STATE field. */
#define NVMC_TESTWORDSTATE_STATE_Erased (0UL) /*!< Erased */
#define NVMC_TESTWORDSTATE_STATE_InvPgm (1UL) /*!< Inverse programmed */
#define NVMC_TESTWORDSTATE_STATE_Written0 (2UL) /*!< Written 0 */
#define NVMC_TESTWORDSTATE_STATE_Written1 (3UL) /*!< Written 1 */

/* Register: NVMC_CONFIG */
/* Description: Configuration register */

/* Bits 14..8 : MODE signals of the non-volatile memory macro */
#define NVMC_CONFIG_MODENVM_Pos (8UL) /*!< Position of MODENVM field. */
#define NVMC_CONFIG_MODENVM_Msk (0x7FUL << NVMC_CONFIG_MODENVM_Pos) /*!< Bit mask of MODENVM field. */

/* Bit 6 : Handling MODE signals of the non-volatile memory macro */
#define NVMC_CONFIG_MODENVMAUTO_Pos (6UL) /*!< Position of MODENVMAUTO field. */
#define NVMC_CONFIG_MODENVMAUTO_Msk (0x1UL << NVMC_CONFIG_MODENVMAUTO_Pos) /*!< Bit mask of MODENVMAUTO field. */
#define NVMC_CONFIG_MODENVMAUTO_Auto (0UL) /*!< Handled by the non-volatile memory controller automatically */
#define NVMC_CONFIG_MODENVMAUTO_Manual (1UL) /*!< Set by CONFIG.MODENVM register */

/* Bit 5 : Page erase configuration */
#define NVMC_CONFIG_ERASEPAGECONFIG_Pos (5UL) /*!< Position of ERASEPAGECONFIG field. */
#define NVMC_CONFIG_ERASEPAGECONFIG_Msk (0x1UL << NVMC_CONFIG_ERASEPAGECONFIG_Pos) /*!< Bit mask of ERASEPAGECONFIG field. */
#define NVMC_CONFIG_ERASEPAGECONFIG_InverseProgram (0UL) /*!< With prior inverse program */
#define NVMC_CONFIG_ERASEPAGECONFIG_NoInverseProgram (1UL) /*!< Without prior inverse program */

/* Bit 4 : Write configuration */
#define NVMC_CONFIG_WRITECONFIG_Pos (4UL) /*!< Position of WRITECONFIG field. */
#define NVMC_CONFIG_WRITECONFIG_Msk (0x1UL << NVMC_CONFIG_WRITECONFIG_Pos) /*!< Bit mask of WRITECONFIG field. */
#define NVMC_CONFIG_WRITECONFIG_InternalVpp (0UL) /*!< Write using internal charge pump */
#define NVMC_CONFIG_WRITECONFIG_ExternalVpp (1UL) /*!< Write using external VPP */

/* Bits 1..0 : Program memory access mode. It is strongly recommended to only activate erase and write modes when they are actively used. Enabling write or erase will invalidate the cache and keep it invalidated. */
#define NVMC_CONFIG_WEN_Pos (0UL) /*!< Position of WEN field. */
#define NVMC_CONFIG_WEN_Msk (0x3UL << NVMC_CONFIG_WEN_Pos) /*!< Bit mask of WEN field. */
#define NVMC_CONFIG_WEN_Ren (0UL) /*!< Read only access */
#define NVMC_CONFIG_WEN_Wen (1UL) /*!< Write enabled */
#define NVMC_CONFIG_WEN_Een (2UL) /*!< Erase enabled */

/* Register: NVMC_ERASEPAGE */
/* Description: Register for erasing a page in code area */

/* Bits 31..0 : Register for starting erase of a page in code area */
#define NVMC_ERASEPAGE_ERASEPAGE_Pos (0UL) /*!< Position of ERASEPAGE field. */
#define NVMC_ERASEPAGE_ERASEPAGE_Msk (0xFFFFFFFFUL << NVMC_ERASEPAGE_ERASEPAGE_Pos) /*!< Bit mask of ERASEPAGE field. */

/* Register: NVMC_ERASEALL */
/* Description: Register for erasing all non-volatile user memory */

/* Bit 0 : Erase all non-volatile memory including UICR registers. The erase must be enabled using CONFIG.WEN before the non-volatile memory can be erased. */
#define NVMC_ERASEALL_ERASEALL_Pos (0UL) /*!< Position of ERASEALL field. */
#define NVMC_ERASEALL_ERASEALL_Msk (0x1UL << NVMC_ERASEALL_ERASEALL_Pos) /*!< Bit mask of ERASEALL field. */
#define NVMC_ERASEALL_ERASEALL_NoOperation (0UL) /*!< No operation */
#define NVMC_ERASEALL_ERASEALL_Erase (1UL) /*!< Start chip erase */

/* Register: NVMC_WAITSTATENUM */
/* Description: Register to set the number of wait-state for non-volatile memory access. To update the WAITSTATENUM field, the ACCESSCODE must be correct. */

/* Bits 31..16 : Access code for modifying this register */
#define NVMC_WAITSTATENUM_ACCESSCODE_Pos (16UL) /*!< Position of ACCESSCODE field. */
#define NVMC_WAITSTATENUM_ACCESSCODE_Msk (0xFFFFUL << NVMC_WAITSTATENUM_ACCESSCODE_Pos) /*!< Bit mask of ACCESSCODE field. */

/* Bits 3..0 : Non-volatile memory wait-states */
#define NVMC_WAITSTATENUM_WAITSTATENUM_Pos (0UL) /*!< Position of WAITSTATENUM field. */
#define NVMC_WAITSTATENUM_WAITSTATENUM_Msk (0xFUL << NVMC_WAITSTATENUM_WAITSTATENUM_Pos) /*!< Bit mask of WAITSTATENUM field. */

/* Register: NVMC_TESTWORD */
/* Description: Test the programming state of the least significant bit in a word */

/* Bits 31..0 : Address of the test word */
#define NVMC_TESTWORD_ADDRESS_Pos (0UL) /*!< Position of ADDRESS field. */
#define NVMC_TESTWORD_ADDRESS_Msk (0xFFFFFFFFUL << NVMC_TESTWORD_ADDRESS_Pos) /*!< Bit mask of ADDRESS field. */

/* Register: NVMC_ICACHECNF */
/* Description: I-code cache configuration register */

/* Bit 8 : Cache profiling enable */
#define NVMC_ICACHECNF_CACHEPROFEN_Pos (8UL) /*!< Position of CACHEPROFEN field. */
#define NVMC_ICACHECNF_CACHEPROFEN_Msk (0x1UL << NVMC_ICACHECNF_CACHEPROFEN_Pos) /*!< Bit mask of CACHEPROFEN field. */
#define NVMC_ICACHECNF_CACHEPROFEN_Disabled (0UL) /*!< Disable cache profiling */
#define NVMC_ICACHECNF_CACHEPROFEN_Enabled (1UL) /*!< Enable cache profiling */

/* Bit 0 : Cache enable */
#define NVMC_ICACHECNF_CACHEEN_Pos (0UL) /*!< Position of CACHEEN field. */
#define NVMC_ICACHECNF_CACHEEN_Msk (0x1UL << NVMC_ICACHECNF_CACHEEN_Pos) /*!< Bit mask of CACHEEN field. */
#define NVMC_ICACHECNF_CACHEEN_Disabled (0UL) /*!< Disable cache. Invalidates all cache entries. */
#define NVMC_ICACHECNF_CACHEEN_Enabled (1UL) /*!< Enable cache */

/* Register: NVMC_IHIT */
/* Description: I-code cache hit counter */

/* Bits 31..0 : Number of cache hits. Register is writable, but only to '0'. */
#define NVMC_IHIT_HITS_Pos (0UL) /*!< Position of HITS field. */
#define NVMC_IHIT_HITS_Msk (0xFFFFFFFFUL << NVMC_IHIT_HITS_Pos) /*!< Bit mask of HITS field. */

/* Register: NVMC_IMISS */
/* Description: I-code cache miss counter */

/* Bits 31..0 : Number of cache misses. Register is writable, but only to '0'. */
#define NVMC_IMISS_MISSES_Pos (0UL) /*!< Position of MISSES field. */
#define NVMC_IMISS_MISSES_Msk (0xFFFFFFFFUL << NVMC_IMISS_MISSES_Pos) /*!< Bit mask of MISSES field. */

/* Register: NVMC_TESTMODE */
/* Description: Register for entering test mode. Refer to the MTP IP test documentation for more details. */

/* Bits 15..0 : Register for entering test mode. Refer to the MTP IP test documentation for more details. This register does not return the same value as written. */
#define NVMC_TESTMODE_TESTMODE_Pos (0UL) /*!< Position of TESTMODE field. */
#define NVMC_TESTMODE_TESTMODE_Msk (0xFFFFUL << NVMC_TESTMODE_TESTMODE_Pos) /*!< Bit mask of TESTMODE field. */
#define NVMC_TESTMODE_TESTMODE_NORMAL (0UL) /*!< Read: Not in test-mode. */
#define NVMC_TESTMODE_TESTMODE_TESTMODE1 (1UL) /*!< Read: In test-mode 1. */
#define NVMC_TESTMODE_TESTMODE_TESTMODE2 (2UL) /*!< Read: In test-mode 2. */
#define NVMC_TESTMODE_TESTMODE_TESTMODE3 (4UL) /*!< Read: In test-mode 3. */
#define NVMC_TESTMODE_TESTMODE_SetNORMAL (0UL) /*!< Write: Sets NORMAL mode. */
#define NVMC_TESTMODE_TESTMODE_SetTESTMODE2 (0xABCDUL) /*!< Write: Sets test-mode 2. */
#define NVMC_TESTMODE_TESTMODE_SetTESTMODE1 (0xBCDEUL) /*!< Write: Sets test-mode 1. */
#define NVMC_TESTMODE_TESTMODE_SetTESTMODE3 (0xCDEFUL) /*!< Write: Sets test-mode 3. */

/* Register: NVMC_TESTMASSERASE */
/* Description: Self-timed mass-erase operation */

/* Bits 1..0 : Self-timed mass-erase operation */
#define NVMC_TESTMASSERASE_TESTMASSERASE_Pos (0UL) /*!< Position of TESTMASSERASE field. */
#define NVMC_TESTMASSERASE_TESTMASSERASE_Msk (0x3UL << NVMC_TESTMASSERASE_TESTMASSERASE_Pos) /*!< Bit mask of TESTMASSERASE field. */
#define NVMC_TESTMASSERASE_TESTMASSERASE_NOOPERATION0 (0UL) /*!< No operation */
#define NVMC_TESTMASSERASE_TESTMASSERASE_NOOPERATION1 (1UL) /*!< No operation */
#define NVMC_TESTMASSERASE_TESTMASSERASE_NOOPERATION2 (2UL) /*!< No operation */
#define NVMC_TESTMASSERASE_TESTMASSERASE_EVERYTHING (3UL) /*!< Erase everything (all information pages and main block) */

/* Register: NVMC_TESTDATA128 */
/* Description: Description collection: Direct MTP test data word n */

/* Bits 31..0 : Returns data out from MTP when reading. Sets MTP data in when writing. */
#define NVMC_TESTDATA128_TESTDATA_Pos (0UL) /*!< Position of TESTDATA field. */
#define NVMC_TESTDATA128_TESTDATA_Msk (0xFFFFFFFFUL << NVMC_TESTDATA128_TESTDATA_Pos) /*!< Bit mask of TESTDATA field. */

/* Register: NVMC_TESTDATA128INC */
/* Description: Description collection: Direct MTP test data word n. Post-increments TESTCONTROLADDR */

/* Bits 31..0 : Returns data out from MTP when reading. Use TESTDATA128[1:0] registers to set the compared data. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access. */
#define NVMC_TESTDATA128INC_TESTDATA_Pos (0UL) /*!< Position of TESTDATA field. */
#define NVMC_TESTDATA128INC_TESTDATA_Msk (0xFFFFFFFFUL << NVMC_TESTDATA128INC_TESTDATA_Pos) /*!< Bit mask of TESTDATA field. */

/* Register: NVMC_TESTCMPINC */
/* Description: Reads and compares last MTP row to TESTDATA128 content. Post-increments TESTCONTROLADDR. */

/* Bit 1 : Reads and compares last MTP row (latched lines) to TESTDATA128 content. Post-increments TESTCONTROLADDR. If TESTCONTROLLINES.CE is high, the read starts by pulsing the CE line low for tNRL. If TESTCONTROLLINES.CE is low, CE remains low for the whole access. */
#define NVMC_TESTCMPINC_LATCHED_Pos (1UL) /*!< Position of LATCHED field. */
#define NVMC_TESTCMPINC_LATCHED_Msk (0x1UL << NVMC_TESTCMPINC_LATCHED_Pos) /*!< Bit mask of LATCHED field. */
#define NVMC_TESTCMPINC_LATCHED_Equal (0UL) /*!< Latched TESTDATA128 content and MTP row read are equal */
#define NVMC_TESTCMPINC_LATCHED_NotEqual (1UL) /*!< Latched TESTDATA128 content and MTP row read are different */

