adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001_bitfields.h
/* Register: RADIO_TASKS_AAFDCCAL_START */
/* Description: Start aafdc calib */

/* Bit 0 : Start aafdc calib */
#define RADIO_TASKS_AAFDCCAL_START_TASKS_AAFDCCAL_START_Pos (0UL) /*!< Position of TASKS_AAFDCCAL_START field. */
#define RADIO_TASKS_AAFDCCAL_START_TASKS_AAFDCCAL_START_Msk (0x1UL << RADIO_TASKS_AAFDCCAL_START_TASKS_AAFDCCAL_START_Pos) /*!< Bit mask of TASKS_AAFDCCAL_START field. */
#define RADIO_TASKS_AAFDCCAL_START_TASKS_AAFDCCAL_START_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_CNTP_START */
/* Description: Start packet counter */

/* Bit 0 : Start packet counter */
#define RADIO_TASKS_CNTP_START_TASKS_CNTP_START_Pos (0UL) /*!< Position of TASKS_CNTP_START field. */
#define RADIO_TASKS_CNTP_START_TASKS_CNTP_START_Msk (0x1UL << RADIO_TASKS_CNTP_START_TASKS_CNTP_START_Pos) /*!< Bit mask of TASKS_CNTP_START field. */
#define RADIO_TASKS_CNTP_START_TASKS_CNTP_START_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_CNTP_STOP */
/* Description: Stop packet counter */

/* Bit 0 : Stop packet counter */
#define RADIO_TASKS_CNTP_STOP_TASKS_CNTP_STOP_Pos (0UL) /*!< Position of TASKS_CNTP_STOP field. */
#define RADIO_TASKS_CNTP_STOP_TASKS_CNTP_STOP_Msk (0x1UL << RADIO_TASKS_CNTP_STOP_TASKS_CNTP_STOP_Pos) /*!< Bit mask of TASKS_CNTP_STOP field. */
#define RADIO_TASKS_CNTP_STOP_TASKS_CNTP_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_CNTP_CLEAR */
/* Description: Clear packet counter */

/* Bit 0 : Clear packet counter */
#define RADIO_TASKS_CNTP_CLEAR_TASKS_CNTP_CLEAR_Pos (0UL) /*!< Position of TASKS_CNTP_CLEAR field. */
#define RADIO_TASKS_CNTP_CLEAR_TASKS_CNTP_CLEAR_Msk (0x1UL << RADIO_TASKS_CNTP_CLEAR_TASKS_CNTP_CLEAR_Pos) /*!< Bit mask of TASKS_CNTP_CLEAR field. */
#define RADIO_TASKS_CNTP_CLEAR_TASKS_CNTP_CLEAR_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DFESTART */
/* Description: Start an AoA/AoD procedure (antenna switching and baseband sampling) */

/* Bit 0 : Start an AoA/AoD procedure (antenna switching and baseband sampling) */
#define RADIO_TASKS_DFESTART_TASKS_DFESTART_Pos (0UL) /*!< Position of TASKS_DFESTART field. */
#define RADIO_TASKS_DFESTART_TASKS_DFESTART_Msk (0x1UL << RADIO_TASKS_DFESTART_TASKS_DFESTART_Pos) /*!< Bit mask of TASKS_DFESTART field. */
#define RADIO_TASKS_DFESTART_TASKS_DFESTART_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DFESTOP */
/* Description: Stop an AoA/AoD procedure */

/* Bit 0 : Stop an AoA/AoD procedure */
#define RADIO_TASKS_DFESTOP_TASKS_DFESTOP_Pos (0UL) /*!< Position of TASKS_DFESTOP field. */
#define RADIO_TASKS_DFESTOP_TASKS_DFESTOP_Msk (0x1UL << RADIO_TASKS_DFESTOP_TASKS_DFESTOP_Pos) /*!< Bit mask of TASKS_DFESTOP field. */
#define RADIO_TASKS_DFESTOP_TASKS_DFESTOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DMA_START */
/* Description: Start DMA transaction */

/* Bit 0 : Start DMA transaction */
#define RADIO_TASKS_DMA_START_TASKS_DMA_START_Pos (0UL) /*!< Position of TASKS_DMA_START field. */
#define RADIO_TASKS_DMA_START_TASKS_DMA_START_Msk (0x1UL << RADIO_TASKS_DMA_START_TASKS_DMA_START_Pos) /*!< Bit mask of TASKS_DMA_START field. */
#define RADIO_TASKS_DMA_START_TASKS_DMA_START_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_DMA_STOP */
/* Description: Stop ongoing DMA transaction */

/* Bit 0 : Stop ongoing DMA transaction */
#define RADIO_TASKS_DMA_STOP_TASKS_DMA_STOP_Pos (0UL) /*!< Position of TASKS_DMA_STOP field. */
#define RADIO_TASKS_DMA_STOP_TASKS_DMA_STOP_Msk (0x1UL << RADIO_TASKS_DMA_STOP_TASKS_DMA_STOP_Pos) /*!< Bit mask of TASKS_DMA_STOP field. */
#define RADIO_TASKS_DMA_STOP_TASKS_DMA_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_ACQSTART */
/* Description: Start data acquisition */

/* Bit 0 : Start data acquisition */
#define RADIO_TASKS_ACQSTART_TASKS_ACQSTART_Pos (0UL) /*!< Position of TASKS_ACQSTART field. */
#define RADIO_TASKS_ACQSTART_TASKS_ACQSTART_Msk (0x1UL << RADIO_TASKS_ACQSTART_TASKS_ACQSTART_Pos) /*!< Bit mask of TASKS_ACQSTART field. */
#define RADIO_TASKS_ACQSTART_TASKS_ACQSTART_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_ACQSTOP */
/* Description: Stop data acquisition */

/* Bit 0 : Stop data acquisition */
#define RADIO_TASKS_ACQSTOP_TASKS_ACQSTOP_Pos (0UL) /*!< Position of TASKS_ACQSTOP field. */
#define RADIO_TASKS_ACQSTOP_TASKS_ACQSTOP_Msk (0x1UL << RADIO_TASKS_ACQSTOP_TASKS_ACQSTOP_Pos) /*!< Bit mask of TASKS_ACQSTOP field. */
#define RADIO_TASKS_ACQSTOP_TASKS_ACQSTOP_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_PCGC_PCP2_ZERO */
/* Description: Zero penalty */

/* Bit 0 : Zero penalty */
#define RADIO_TASKS_PCGC_PCP2_ZERO_TASKS_PCGC_PCP2_ZERO_Pos (0UL) /*!< Position of TASKS_PCGC_PCP2_ZERO field. */
#define RADIO_TASKS_PCGC_PCP2_ZERO_TASKS_PCGC_PCP2_ZERO_Msk (0x1UL << RADIO_TASKS_PCGC_PCP2_ZERO_TASKS_PCGC_PCP2_ZERO_Pos) /*!< Bit mask of TASKS_PCGC_PCP2_ZERO field. */
#define RADIO_TASKS_PCGC_PCP2_ZERO_TASKS_PCGC_PCP2_ZERO_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_PCGC_PCP2_FULL */
/* Description: Full penalty */

/* Bit 0 : Full penalty */
#define RADIO_TASKS_PCGC_PCP2_FULL_TASKS_PCGC_PCP2_FULL_Pos (0UL) /*!< Position of TASKS_PCGC_PCP2_FULL field. */
#define RADIO_TASKS_PCGC_PCP2_FULL_TASKS_PCGC_PCP2_FULL_Msk (0x1UL << RADIO_TASKS_PCGC_PCP2_FULL_TASKS_PCGC_PCP2_FULL_Pos) /*!< Bit mask of TASKS_PCGC_PCP2_FULL field. */
#define RADIO_TASKS_PCGC_PCP2_FULL_TASKS_PCGC_PCP2_FULL_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_PCGC_PCP1_ZERO */
/* Description: Zero penalty */

/* Bit 0 : Zero penalty */
#define RADIO_TASKS_PCGC_PCP1_ZERO_TASKS_PCGC_PCP1_ZERO_Pos (0UL) /*!< Position of TASKS_PCGC_PCP1_ZERO field. */
#define RADIO_TASKS_PCGC_PCP1_ZERO_TASKS_PCGC_PCP1_ZERO_Msk (0x1UL << RADIO_TASKS_PCGC_PCP1_ZERO_TASKS_PCGC_PCP1_ZERO_Pos) /*!< Bit mask of TASKS_PCGC_PCP1_ZERO field. */
#define RADIO_TASKS_PCGC_PCP1_ZERO_TASKS_PCGC_PCP1_ZERO_Trigger (1UL) /*!< Trigger task */

/* Register: RADIO_TASKS_PCGC_PCP1_FULL */
/* Description: Full penalty */

/* Bit 0 : Full penalty */
#define RADIO_TASKS_PCGC_PCP1_FULL_TASKS_PCGC_PCP1_FULL_Pos (0UL) /*!< Position of TASKS_PCGC_PCP1_FULL field. */
#define RADIO_TASKS_PCGC_PCP1_FULL_TASKS_PCGC_PCP1_FULL_Msk (0x1UL << RADIO_TASKS_PCGC_PCP1_FULL_TASKS_PCGC_PCP1_FULL_Pos) /*!< Bit mask of TASKS_PCGC_PCP1_FULL field. */
#define RADIO_TASKS_PCGC_PCP1_FULL_TASKS_PCGC_PCP1_FULL_Trigger (1UL) /*!< Trigger task */

