adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001_bitfields.h
/* Register: RADIO_SUBSCRIBE_BCSTOP */
/* Description: Subscribe configuration for task BCSTOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_BCSTOP_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_BCSTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_BCSTOP_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_BCSTOP_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_BCSTOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task BCSTOP will subscribe to */
#define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_BCSTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_BCSTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_AAFDCCAL_START */
/* Description: Subscribe configuration for task AAFDCCAL_START */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_AAFDCCAL_START_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_AAFDCCAL_START_EN_Msk (0x1UL << RADIO_SUBSCRIBE_AAFDCCAL_START_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_AAFDCCAL_START_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_AAFDCCAL_START_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task AAFDCCAL_START will subscribe to */
#define RADIO_SUBSCRIBE_AAFDCCAL_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_AAFDCCAL_START_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_AAFDCCAL_START_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_CNTP_START */
/* Description: Subscribe configuration for task CNTP_START */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CNTP_START_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_CNTP_START_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CNTP_START_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_CNTP_START_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_CNTP_START_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CNTP_START will subscribe to */
#define RADIO_SUBSCRIBE_CNTP_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_CNTP_START_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CNTP_START_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_CNTP_STOP */
/* Description: Subscribe configuration for task CNTP_STOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CNTP_STOP_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_CNTP_STOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CNTP_STOP_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_CNTP_STOP_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_CNTP_STOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CNTP_STOP will subscribe to */
#define RADIO_SUBSCRIBE_CNTP_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_CNTP_STOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CNTP_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_CNTP_CLEAR */
/* Description: Subscribe configuration for task CNTP_CLEAR */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_CNTP_CLEAR_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_CNTP_CLEAR_EN_Msk (0x1UL << RADIO_SUBSCRIBE_CNTP_CLEAR_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_CNTP_CLEAR_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_CNTP_CLEAR_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task CNTP_CLEAR will subscribe to */
#define RADIO_SUBSCRIBE_CNTP_CLEAR_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_CNTP_CLEAR_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_CNTP_CLEAR_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_DFESTART */
/* Description: Subscribe configuration for task DFESTART */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DFESTART_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_DFESTART_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DFESTART_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_DFESTART_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_DFESTART_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task DFESTART will subscribe to */
#define RADIO_SUBSCRIBE_DFESTART_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_DFESTART_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DFESTART_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_DFESTOP */
/* Description: Subscribe configuration for task DFESTOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DFESTOP_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_DFESTOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DFESTOP_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_DFESTOP_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_DFESTOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task DFESTOP will subscribe to */
#define RADIO_SUBSCRIBE_DFESTOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_DFESTOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DFESTOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_DMA_START */
/* Description: Subscribe configuration for task DMA_START */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DMA_START_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_DMA_START_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DMA_START_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_DMA_START_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_DMA_START_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task DMA_START will subscribe to */
#define RADIO_SUBSCRIBE_DMA_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_DMA_START_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DMA_START_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: RADIO_SUBSCRIBE_DMA_STOP */
/* Description: Subscribe configuration for task DMA_STOP */

/* Bit 31 :   */
#define RADIO_SUBSCRIBE_DMA_STOP_EN_Pos (31UL) /*!< Position of EN field. */
#define RADIO_SUBSCRIBE_DMA_STOP_EN_Msk (0x1UL << RADIO_SUBSCRIBE_DMA_STOP_EN_Pos) /*!< Bit mask of EN field. */
#define RADIO_SUBSCRIBE_DMA_STOP_EN_Disabled (0UL) /*!< Disable subscription */
#define RADIO_SUBSCRIBE_DMA_STOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task DMA_STOP will subscribe to */
#define RADIO_SUBSCRIBE_DMA_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define RADIO_SUBSCRIBE_DMA_STOP_CHIDX_Msk (0xFFUL << RADIO_SUBSCRIBE_DMA_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

