adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001_bitfields.h
/* Bits 7..0 : DPPI channel that event EP0SETUP will publish to. */
#define USBD_PUBLISH_EP0SETUP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define USBD_PUBLISH_EP0SETUP_CHIDX_Msk (0xFFUL << USBD_PUBLISH_EP0SETUP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_EPDATA */
/* Description: Publish configuration for event EPDATA */

/* Bit 31 :   */
#define USBD_PUBLISH_EPDATA_EN_Pos (31UL) /*!< Position of EN field. */
#define USBD_PUBLISH_EPDATA_EN_Msk (0x1UL << USBD_PUBLISH_EPDATA_EN_Pos) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_EPDATA_EN_Disabled (0UL) /*!< Disable publishing */
#define USBD_PUBLISH_EPDATA_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event EPDATA will publish to. */
#define USBD_PUBLISH_EPDATA_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define USBD_PUBLISH_EPDATA_CHIDX_Msk (0xFFUL << USBD_PUBLISH_EPDATA_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: USBD_PUBLISH_ACCESSFAULT */
/* Description: Publish configuration for event ACCESSFAULT */

/* Bit 31 :   */
#define USBD_PUBLISH_ACCESSFAULT_EN_Pos (31UL) /*!< Position of EN field. */
#define USBD_PUBLISH_ACCESSFAULT_EN_Msk (0x1UL << USBD_PUBLISH_ACCESSFAULT_EN_Pos) /*!< Bit mask of EN field. */
#define USBD_PUBLISH_ACCESSFAULT_EN_Disabled (0UL) /*!< Disable publishing */
#define USBD_PUBLISH_ACCESSFAULT_EN_Enabled (1UL) /*!< Enable publishing */

/* Bits 7..0 : DPPI channel that event ACCESSFAULT will publish to. */
#define USBD_PUBLISH_ACCESSFAULT_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define USBD_PUBLISH_ACCESSFAULT_CHIDX_Msk (0xFFUL << USBD_PUBLISH_ACCESSFAULT_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: USBD_SHORTS */
/* Description: Shortcuts between local events and tasks */

/* Bit 8 : Shortcut between event ENDISOOUT and task STARTISOIN */
#define USBD_SHORTS_ENDISOOUT_STARTISOIN_Pos (8UL) /*!< Position of ENDISOOUT_STARTISOIN field. */
#define USBD_SHORTS_ENDISOOUT_STARTISOIN_Msk (0x1UL << USBD_SHORTS_ENDISOOUT_STARTISOIN_Pos) /*!< Bit mask of ENDISOOUT_STARTISOIN field. */
#define USBD_SHORTS_ENDISOOUT_STARTISOIN_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_ENDISOOUT_STARTISOIN_Enabled (1UL) /*!< Enable shortcut */

/* Bit 7 : Shortcut between event ENDISOIN and task STARTISOOUT */
#define USBD_SHORTS_ENDISOIN_STARTISOOUT_Pos (7UL) /*!< Position of ENDISOIN_STARTISOOUT field. */
#define USBD_SHORTS_ENDISOIN_STARTISOOUT_Msk (0x1UL << USBD_SHORTS_ENDISOIN_STARTISOOUT_Pos) /*!< Bit mask of ENDISOIN_STARTISOOUT field. */
#define USBD_SHORTS_ENDISOIN_STARTISOOUT_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_ENDISOIN_STARTISOOUT_Enabled (1UL) /*!< Enable shortcut */

/* Bit 6 : Shortcut between event SOF and task STARTISOOUT */
#define USBD_SHORTS_SOF_STARTISOOUT_Pos (6UL) /*!< Position of SOF_STARTISOOUT field. */
#define USBD_SHORTS_SOF_STARTISOOUT_Msk (0x1UL << USBD_SHORTS_SOF_STARTISOOUT_Pos) /*!< Bit mask of SOF_STARTISOOUT field. */
#define USBD_SHORTS_SOF_STARTISOOUT_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_SOF_STARTISOOUT_Enabled (1UL) /*!< Enable shortcut */

/* Bit 5 : Shortcut between event SOF and task STARTISOIN */
#define USBD_SHORTS_SOF_STARTISOIN_Pos (5UL) /*!< Position of SOF_STARTISOIN field. */
#define USBD_SHORTS_SOF_STARTISOIN_Msk (0x1UL << USBD_SHORTS_SOF_STARTISOIN_Pos) /*!< Bit mask of SOF_STARTISOIN field. */
#define USBD_SHORTS_SOF_STARTISOIN_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_SOF_STARTISOIN_Enabled (1UL) /*!< Enable shortcut */

/* Bit 4 : Shortcut between event ENDEPOUT[0] and task EP0RCVOUT */
#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_Pos (4UL) /*!< Position of ENDEPOUT0_EP0RCVOUT field. */
#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_Msk (0x1UL << USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_Pos) /*!< Bit mask of ENDEPOUT0_EP0RCVOUT field. */
#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_ENDEPOUT0_EP0RCVOUT_Enabled (1UL) /*!< Enable shortcut */

/* Bit 3 : Shortcut between event ENDEPOUT[0] and task EP0STATUS */
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS_Pos (3UL) /*!< Position of ENDEPOUT0_EP0STATUS field. */
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS_Msk (0x1UL << USBD_SHORTS_ENDEPOUT0_EP0STATUS_Pos) /*!< Bit mask of ENDEPOUT0_EP0STATUS field. */
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_ENDEPOUT0_EP0STATUS_Enabled (1UL) /*!< Enable shortcut */

/* Bit 2 : Shortcut between event EP0DATADONE and task EP0STATUS */
#define USBD_SHORTS_EP0DATADONE_EP0STATUS_Pos (2UL) /*!< Position of EP0DATADONE_EP0STATUS field. */
#define USBD_SHORTS_EP0DATADONE_EP0STATUS_Msk (0x1UL << USBD_SHORTS_EP0DATADONE_EP0STATUS_Pos) /*!< Bit mask of EP0DATADONE_EP0STATUS field. */
#define USBD_SHORTS_EP0DATADONE_EP0STATUS_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_EP0DATADONE_EP0STATUS_Enabled (1UL) /*!< Enable shortcut */

/* Bit 1 : Shortcut between event EP0DATADONE and task STARTEPOUT[0] */
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0_Pos (1UL) /*!< Position of EP0DATADONE_STARTEPOUT0 field. */
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0_Msk (0x1UL << USBD_SHORTS_EP0DATADONE_STARTEPOUT0_Pos) /*!< Bit mask of EP0DATADONE_STARTEPOUT0 field. */
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_EP0DATADONE_STARTEPOUT0_Enabled (1UL) /*!< Enable shortcut */

/* Bit 0 : Shortcut between event EP0DATADONE and task STARTEPIN[0] */
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0_Pos (0UL) /*!< Position of EP0DATADONE_STARTEPIN0 field. */
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0_Msk (0x1UL << USBD_SHORTS_EP0DATADONE_STARTEPIN0_Pos) /*!< Bit mask of EP0DATADONE_STARTEPIN0 field. */
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0_Disabled (0UL) /*!< Disable shortcut */
#define USBD_SHORTS_EP0DATADONE_STARTEPIN0_Enabled (1UL) /*!< Enable shortcut */

/* Register: USBD_INTEN */
/* Description: Enable or disable interrupt */

/* Bit 25 : Enable or disable interrupt for event ACCESSFAULT */
#define USBD_INTEN_ACCESSFAULT_Pos (25UL) /*!< Position of ACCESSFAULT field. */
#define USBD_INTEN_ACCESSFAULT_Msk (0x1UL << USBD_INTEN_ACCESSFAULT_Pos) /*!< Bit mask of ACCESSFAULT field. */
#define USBD_INTEN_ACCESSFAULT_Disabled (0UL) /*!< Disable */
#define USBD_INTEN_ACCESSFAULT_Enabled (1UL) /*!< Enable */

/* Bit 24 : Enable or disable interrupt for event EPDATA */
#define USBD_INTEN_EPDATA_Pos (24UL) /*!< Position of EPDATA field. */
#define USBD_INTEN_EPDATA_Msk (0x1UL << USBD_INTEN_EPDATA_Pos) /*!< Bit mask of EPDATA field. */
#define USBD_INTEN_EPDATA_Disabled (0UL) /*!< Disable */
#define USBD_INTEN_EPDATA_Enabled (1UL) /*!< Enable */

