adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001_bitfields.h
/* Register: USBD_ISOIN_CONFIG */
/* Description: Isochronous endpoint EasyDMA configuration */

/* Bits 1..0 : DMA transfer size */
#define USBD_ISOIN_CONFIG_DMASIZE_Pos (0UL) /*!< Position of DMASIZE field. */
#define USBD_ISOIN_CONFIG_DMASIZE_Msk (0x3UL << USBD_ISOIN_CONFIG_DMASIZE_Pos) /*!< Bit mask of DMASIZE field. */
#define USBD_ISOIN_CONFIG_DMASIZE_Byte (0UL) /*!< DMA transfer size is 8 bits */
#define USBD_ISOIN_CONFIG_DMASIZE_Short (1UL) /*!< DMA transfer size is 16 bits (buffer must be aligned accordingly) */
#define USBD_ISOIN_CONFIG_DMASIZE_Long (2UL) /*!< DMA transfer size is 32 bits (buffer must be aligned accordingly) */

/* Register: USBD_EPOUT_PTR */
/* Description: Description cluster: Data pointer */

/* Bits 31..0 : Data pointer */
#define USBD_EPOUT_PTR_PTR_Pos (0UL) /*!< Position of PTR field. */
#define USBD_EPOUT_PTR_PTR_Msk (0xFFFFFFFFUL << USBD_EPOUT_PTR_PTR_Pos) /*!< Bit mask of PTR field. */

/* Register: USBD_EPOUT_MAXCNT */
/* Description: Description cluster: Maximum number of bytes to transfer */

/* Bits 15..0 : Maximum number of bytes to transfer */
#define USBD_EPOUT_MAXCNT_MAXCNT_Pos (0UL) /*!< Position of MAXCNT field. */
#define USBD_EPOUT_MAXCNT_MAXCNT_Msk (0xFFFFUL << USBD_EPOUT_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field. */

/* Register: USBD_EPOUT_AMOUNT */
/* Description: Description cluster: Number of bytes transferred in the last transaction */

/* Bits 15..0 : Number of bytes transferred in the last transaction */
#define USBD_EPOUT_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define USBD_EPOUT_AMOUNT_AMOUNT_Msk (0xFFFFUL << USBD_EPOUT_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

/* Register: USBD_EPOUT_CONFIG */
/* Description: Description cluster: Endpoint EasyDMA configuration */

/* Bits 1..0 : DMA transfer size */
#define USBD_EPOUT_CONFIG_DMASIZE_Pos (0UL) /*!< Position of DMASIZE field. */
#define USBD_EPOUT_CONFIG_DMASIZE_Msk (0x3UL << USBD_EPOUT_CONFIG_DMASIZE_Pos) /*!< Bit mask of DMASIZE field. */
#define USBD_EPOUT_CONFIG_DMASIZE_Byte (0UL) /*!< DMA transfer size is 8 bit */
#define USBD_EPOUT_CONFIG_DMASIZE_Short (1UL) /*!< DMA transfer size is 16 bit (buffer must be aligned accordingly) */
#define USBD_EPOUT_CONFIG_DMASIZE_Long (2UL) /*!< DMA transfer size is 32 bit (buffer must be aligned accordingly) */

/* Register: USBD_EPOUT_LIST */
/* Description: Description cluster: EasyDMA list type */

/* Bits 2..0 : List type */
#define USBD_EPOUT_LIST_LIST_Pos (0UL) /*!< Position of LIST field. */
#define USBD_EPOUT_LIST_LIST_Msk (0x7UL << USBD_EPOUT_LIST_LIST_Pos) /*!< Bit mask of LIST field. */
#define USBD_EPOUT_LIST_LIST_Disabled (0UL) /*!< Normal EasyDMA operation */
#define USBD_EPOUT_LIST_LIST_ArrayList (1UL) /*!< Use array list (auto-increment of .PTR) */

/* Register: USBD_ISOOUT_PTR */
/* Description: Data pointer */

/* Bits 31..0 : Data pointer */
#define USBD_ISOOUT_PTR_PTR_Pos (0UL) /*!< Position of PTR field. */
#define USBD_ISOOUT_PTR_PTR_Msk (0xFFFFFFFFUL << USBD_ISOOUT_PTR_PTR_Pos) /*!< Bit mask of PTR field. */

/* Register: USBD_ISOOUT_MAXCNT */
/* Description: Maximum number of bytes to transfer */

/* Bits 15..0 : Maximum number of bytes to transfer */
#define USBD_ISOOUT_MAXCNT_MAXCNT_Pos (0UL) /*!< Position of MAXCNT field. */
#define USBD_ISOOUT_MAXCNT_MAXCNT_Msk (0xFFFFUL << USBD_ISOOUT_MAXCNT_MAXCNT_Pos) /*!< Bit mask of MAXCNT field. */

/* Register: USBD_ISOOUT_AMOUNT */
/* Description: Number of bytes transferred in the last transaction */

/* Bits 15..0 : Number of bytes transferred in the last transaction */
#define USBD_ISOOUT_AMOUNT_AMOUNT_Pos (0UL) /*!< Position of AMOUNT field. */
#define USBD_ISOOUT_AMOUNT_AMOUNT_Msk (0xFFFFUL << USBD_ISOOUT_AMOUNT_AMOUNT_Pos) /*!< Bit mask of AMOUNT field. */

/* Register: USBD_ISOOUT_CONFIG */
/* Description: Isochronous endpoint EasyDMA configuration */

/* Bits 1..0 : DMA transfer size */
#define USBD_ISOOUT_CONFIG_DMASIZE_Pos (0UL) /*!< Position of DMASIZE field. */
#define USBD_ISOOUT_CONFIG_DMASIZE_Msk (0x3UL << USBD_ISOOUT_CONFIG_DMASIZE_Pos) /*!< Bit mask of DMASIZE field. */
#define USBD_ISOOUT_CONFIG_DMASIZE_Byte (0UL) /*!< DMA transfer size is 8 bits */
#define USBD_ISOOUT_CONFIG_DMASIZE_Short (1UL) /*!< DMA transfer size is 16 bits (buffer must be aligned accordingly) */
#define USBD_ISOOUT_CONFIG_DMASIZE_Long (2UL) /*!< DMA transfer size is 32 bits (buffer must be aligned accordingly) */

/* Register: USBD_RAWADDR */
/* Description: Address to be used for accessing the MAC IP4000 */

/* Bits 10..0 : IP4000 address space */
#define USBD_RAWADDR_ADDR_Pos (0UL) /*!< Position of ADDR field. */
#define USBD_RAWADDR_ADDR_Msk (0x7FFUL << USBD_RAWADDR_ADDR_Pos) /*!< Bit mask of ADDR field. */

/* Register: USBD_RAWDATA */
/* Description: Actual read or write access to the raw IP, using RAWADDR address */

/* Bits 7..0 : data */
#define USBD_RAWDATA_DATA_Pos (0UL) /*!< Position of DATA field. */
#define USBD_RAWDATA_DATA_Msk (0xFFUL << USBD_RAWDATA_DATA_Pos) /*!< Bit mask of DATA field. */

/* Register: USBD_PENALTY_DIG */
/* Description: Description collection: PcgcSlaveDig */

/* Bits 31..2 : Unused bits, always reads as ones */
#define USBD_PENALTY_DIG_UNUSED_Pos (2UL) /*!< Position of UNUSED field. */
#define USBD_PENALTY_DIG_UNUSED_Msk (0x3FFFFFFFUL << USBD_PENALTY_DIG_UNUSED_Pos) /*!< Bit mask of UNUSED field. */

/* Bits 1..0 :   */
#define USBD_PENALTY_DIG_PENALTY_DIG_Pos (0UL) /*!< Position of PENALTY_DIG field. */
#define USBD_PENALTY_DIG_PENALTY_DIG_Msk (0x3UL << USBD_PENALTY_DIG_PENALTY_DIG_Pos) /*!< Bit mask of PENALTY_DIG field. */
#define USBD_PENALTY_DIG_PENALTY_DIG_AUTO0 (0UL) /*!< Full penalty: Power core, Power switch, Clock core, Clock buffer and Clock switch can turn off */
#define USBD_PENALTY_DIG_PENALTY_DIG_AUTO1 (1UL) /*!< Clock core, Clock buffer and Clock switch can turn off, Power core and Power switch are kept on */
#define USBD_PENALTY_DIG_PENALTY_DIG_AUTO2 (2UL) /*!< Clock buffer and Clock switch can turn off, Power core, Power switch and Clock core are kept on */
#define USBD_PENALTY_DIG_PENALTY_DIG_AUTO3 (3UL) /*!< Zero penalty: Clock switch can turn off, Power core, Power switch, Clock core and Clock buffer are kept on */

/* Register: USBD_PENALTY_MAIN0 */
/* Description: Description collection: PcgcSlaveMain */

/* Bits 31..2 : Unused bits, always reads as ones */
#define USBD_PENALTY_MAIN0_UNUSED_Pos (2UL) /*!< Position of UNUSED field. */
#define USBD_PENALTY_MAIN0_UNUSED_Msk (0x3FFFFFFFUL << USBD_PENALTY_MAIN0_UNUSED_Pos) /*!< Bit mask of UNUSED field. */

/* Bits 1..0 :   */
#define USBD_PENALTY_MAIN0_PENALTY_DIG1_Pos (0UL) /*!< Position of PENALTY_DIG1 field. */
#define USBD_PENALTY_MAIN0_PENALTY_DIG1_Msk (0x3UL << USBD_PENALTY_MAIN0_PENALTY_DIG1_Pos) /*!< Bit mask of PENALTY_DIG1 field. */
#define USBD_PENALTY_MAIN0_PENALTY_DIG1_AUTO0 (0UL) /*!< Full penalty: Power core, Power switch, Clock core, Clock buffer and Clock switch can turn off */
#define USBD_PENALTY_MAIN0_PENALTY_DIG1_AUTO1 (1UL) /*!< Clock core, Clock buffer and Clock switch can turn off, Power core and Power switch are kept on */
#define USBD_PENALTY_MAIN0_PENALTY_DIG1_AUTO2 (2UL) /*!< Clock buffer and Clock switch can turn off, Power core, Power switch and Clock core are kept on */
#define USBD_PENALTY_MAIN0_PENALTY_DIG1_AUTO3 (3UL) /*!< Zero penalty: Clock switch can turn off, Power core, Power switch, Clock core and Clock buffer are kept on */

/* Register: USBD_FORCE_OVERRIDE_DIG */
/* Description: Description collection: Clock and power request override register for PCPn in PcgcSlaveDig */

/* Bit 15 :   */
#define USBD_FORCE_OVERRIDE_DIG_DOFORCEPOWER_Pos (15UL) /*!< Position of DOFORCEPOWER field. */
#define USBD_FORCE_OVERRIDE_DIG_DOFORCEPOWER_Msk (0x1UL << USBD_FORCE_OVERRIDE_DIG_DOFORCEPOWER_Pos) /*!< Bit mask of DOFORCEPOWER field. */
#define USBD_FORCE_OVERRIDE_DIG_DOFORCEPOWER_Disable (0UL) /*!< Disable forcing of the power request signals */
#define USBD_FORCE_OVERRIDE_DIG_DOFORCEPOWER_Enable (1UL) /*!< Enable forcing of the power request signals */

/* Bit 9 : Force powerRequest[n].core if doForcePower is set. If doForcePower is not set, powerRequest[n].core is not overridden. */
#define USBD_FORCE_OVERRIDE_DIG_POWERFORCINGCORE_Pos (9UL) /*!< Position of POWERFORCINGCORE field. */
#define USBD_FORCE_OVERRIDE_DIG_POWERFORCINGCORE_Msk (0x1UL << USBD_FORCE_OVERRIDE_DIG_POWERFORCINGCORE_Pos) /*!< Bit mask of POWERFORCINGCORE field. */
#define USBD_FORCE_OVERRIDE_DIG_POWERFORCINGCORE_ForceLow (0UL) /*!< Forces powerRequest[n].core is overridden to 0. */
#define USBD_FORCE_OVERRIDE_DIG_POWERFORCINGCORE_ForceHigh (1UL) /*!< Forces powerRequest[n].core is overridden to 1. */

/* Bit 8 : Force powerRequest[n].switch If doForcePower is set. If doForcePower is not set, powerRequest[n].switch is not overridden. */
#define USBD_FORCE_OVERRIDE_DIG_POWERFORCINGSWITCH_Pos (8UL) /*!< Position of POWERFORCINGSWITCH field. */
#define USBD_FORCE_OVERRIDE_DIG_POWERFORCINGSWITCH_Msk (0x1UL << USBD_FORCE_OVERRIDE_DIG_POWERFORCINGSWITCH_Pos) /*!< Bit mask of POWERFORCINGSWITCH field. */
#define USBD_FORCE_OVERRIDE_DIG_POWERFORCINGSWITCH_ForceLow (0UL) /*!< Forces powerRequest[n].switch is overridden to 0. */
#define USBD_FORCE_OVERRIDE_DIG_POWERFORCINGSWITCH_ForceHigh (1UL) /*!< Forces powerRequest[n].switch is overridden to 1. */

