adamkondraciuk/hal_nordic/nrfx/mdk/nrf5001_bitfields.h
/* Bit 7 : Enable or disable the forcing of clock request signals */
#define USBD_FORCE_OVERRIDE_DIG_DOFORCECLOCK_Pos (7UL) /*!< Position of DOFORCECLOCK field. */
#define USBD_FORCE_OVERRIDE_DIG_DOFORCECLOCK_Msk (0x1UL << USBD_FORCE_OVERRIDE_DIG_DOFORCECLOCK_Pos) /*!< Bit mask of DOFORCECLOCK field. */
#define USBD_FORCE_OVERRIDE_DIG_DOFORCECLOCK_Disable (0UL) /*!< Disable forcing of the clock request signals */
#define USBD_FORCE_OVERRIDE_DIG_DOFORCECLOCK_Enable (1UL) /*!< Enable forcing of the clock request signals */

/* Bit 3 : Force clockRequest[n].core if doForceClock is set. If doForceClock is not set, clockRequest[n].core is not overridden. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGCORE_Pos (3UL) /*!< Position of CLOCKFORCINGCORE field. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGCORE_Msk (0x1UL << USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGCORE_Pos) /*!< Bit mask of CLOCKFORCINGCORE field. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGCORE_ForceLow (0UL) /*!< Forces clockRequest[n].core is overridden to 0. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGCORE_ForceHigh (1UL) /*!< Forces clockRequest[n].core is overridden to 1. */

/* Bit 2 : Force clockRequest[n].buff if doForceClock is set. If doForceClock is not set, clockRequest[n].buff is not overridden. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGBUFF_Pos (2UL) /*!< Position of CLOCKFORCINGBUFF field. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGBUFF_Msk (0x1UL << USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGBUFF_Pos) /*!< Bit mask of CLOCKFORCINGBUFF field. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGBUFF_ForceLow (0UL) /*!< Forces clockRequest[n].buff is overridden to 0. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGBUFF_ForceHigh (1UL) /*!< Forces clockRequest[n].buff is overridden to 1. */

/* Bit 1 : Force clockRequest[n].switch if doForceClock is set. If doForceClock is not set, clockRequest[n].switch is not overridden. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGSWITCH_Pos (1UL) /*!< Position of CLOCKFORCINGSWITCH field. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGSWITCH_Msk (0x1UL << USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGSWITCH_Pos) /*!< Bit mask of CLOCKFORCINGSWITCH field. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGSWITCH_ForceLow (0UL) /*!< Forces clockRequest[n].switch is overridden to 0. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGSWITCH_ForceHigh (1UL) /*!< Forces clockRequest[n].switch is overridden to 1. */

/* Bit 0 : Force clockRequest[n].switch_a if doForceClock is set. If doForceClock is not set, clockRequest[n].switch_a is not overridden. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGSWITCH_A_Pos (0UL) /*!< Position of CLOCKFORCINGSWITCH_A field. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGSWITCH_A_Msk (0x1UL << USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGSWITCH_A_Pos) /*!< Bit mask of CLOCKFORCINGSWITCH_A field. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGSWITCH_A_ForceLow (0UL) /*!< Forces clockRequest[n].switch_a is overridden to 0. */
#define USBD_FORCE_OVERRIDE_DIG_CLOCKFORCINGSWITCH_A_ForceHigh (1UL) /*!< Forces clockRequest[n].switch_a is overridden to 1. */

/* Register: USBD_TURN_OFF_AUTO_CLOCKSOURCE_REQ */
/* Description: Unused */

/* Bits 31..0 : Always reads as zero */
#define USBD_TURN_OFF_AUTO_CLOCKSOURCE_REQ_UNUSED_Pos (0UL) /*!< Position of UNUSED field. */
#define USBD_TURN_OFF_AUTO_CLOCKSOURCE_REQ_UNUSED_Msk (0xFFFFFFFFUL << USBD_TURN_OFF_AUTO_CLOCKSOURCE_REQ_UNUSED_Pos) /*!< Bit mask of UNUSED field. */


/* Peripheral: VMC */
/* Description: Volatile Memory controller */

/* Register: VMC_RAM_POWER */
/* Description: Description cluster: RAM[n] power control register */

/* Bit 17 : Keep retention on RAM section S1 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S1RETENTION_Pos (17UL) /*!< Position of S1RETENTION field. */
#define VMC_RAM_POWER_S1RETENTION_Msk (0x1UL << VMC_RAM_POWER_S1RETENTION_Pos) /*!< Bit mask of S1RETENTION field. */
#define VMC_RAM_POWER_S1RETENTION_Off (0UL) /*!< Off */
#define VMC_RAM_POWER_S1RETENTION_On (1UL) /*!< On */

/* Bit 16 : Keep retention on RAM section S0 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWER_S0RETENTION_Pos (16UL) /*!< Position of S0RETENTION field. */
#define VMC_RAM_POWER_S0RETENTION_Msk (0x1UL << VMC_RAM_POWER_S0RETENTION_Pos) /*!< Bit mask of S0RETENTION field. */
#define VMC_RAM_POWER_S0RETENTION_Off (0UL) /*!< Off */
#define VMC_RAM_POWER_S0RETENTION_On (1UL) /*!< On */

/* Bit 1 : Keep RAM section S1 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S1POWER_Pos (1UL) /*!< Position of S1POWER field. */
#define VMC_RAM_POWER_S1POWER_Msk (0x1UL << VMC_RAM_POWER_S1POWER_Pos) /*!< Bit mask of S1POWER field. */
#define VMC_RAM_POWER_S1POWER_Off (0UL) /*!< Off */
#define VMC_RAM_POWER_S1POWER_On (1UL) /*!< On */

/* Bit 0 : Keep RAM section S0 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWER_S0POWER_Pos (0UL) /*!< Position of S0POWER field. */
#define VMC_RAM_POWER_S0POWER_Msk (0x1UL << VMC_RAM_POWER_S0POWER_Pos) /*!< Bit mask of S0POWER field. */
#define VMC_RAM_POWER_S0POWER_Off (0UL) /*!< Off */
#define VMC_RAM_POWER_S0POWER_On (1UL) /*!< On */

/* Register: VMC_RAM_POWERSET */
/* Description: Description cluster: RAM[n] power control set register */

/* Bit 17 : Keep retention on RAM section S1 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERSET_S1RETENTION_Pos (17UL) /*!< Position of S1RETENTION field. */
#define VMC_RAM_POWERSET_S1RETENTION_Msk (0x1UL << VMC_RAM_POWERSET_S1RETENTION_Pos) /*!< Bit mask of S1RETENTION field. */
#define VMC_RAM_POWERSET_S1RETENTION_On (1UL) /*!< On */

/* Bit 16 : Keep retention on RAM section S0 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERSET_S0RETENTION_Pos (16UL) /*!< Position of S0RETENTION field. */
#define VMC_RAM_POWERSET_S0RETENTION_Msk (0x1UL << VMC_RAM_POWERSET_S0RETENTION_Pos) /*!< Bit mask of S0RETENTION field. */
#define VMC_RAM_POWERSET_S0RETENTION_On (1UL) /*!< On */

/* Bit 1 : Keep RAM section S1 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S1POWER_Pos (1UL) /*!< Position of S1POWER field. */
#define VMC_RAM_POWERSET_S1POWER_Msk (0x1UL << VMC_RAM_POWERSET_S1POWER_Pos) /*!< Bit mask of S1POWER field. */
#define VMC_RAM_POWERSET_S1POWER_On (1UL) /*!< On */

/* Bit 0 : Keep RAM section S0 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERSET_S0POWER_Pos (0UL) /*!< Position of S0POWER field. */
#define VMC_RAM_POWERSET_S0POWER_Msk (0x1UL << VMC_RAM_POWERSET_S0POWER_Pos) /*!< Bit mask of S0POWER field. */
#define VMC_RAM_POWERSET_S0POWER_On (1UL) /*!< On */

/* Register: VMC_RAM_POWERCLR */
/* Description: Description cluster: RAM[n] power control clear register */

/* Bit 17 : Keep retention on RAM section S1 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S1RETENTION_Pos (17UL) /*!< Position of S1RETENTION field. */
#define VMC_RAM_POWERCLR_S1RETENTION_Msk (0x1UL << VMC_RAM_POWERCLR_S1RETENTION_Pos) /*!< Bit mask of S1RETENTION field. */
#define VMC_RAM_POWERCLR_S1RETENTION_Off (1UL) /*!< Off */

/* Bit 16 : Keep retention on RAM section S0 of RAM[n] when RAM section is switched off */
#define VMC_RAM_POWERCLR_S0RETENTION_Pos (16UL) /*!< Position of S0RETENTION field. */
#define VMC_RAM_POWERCLR_S0RETENTION_Msk (0x1UL << VMC_RAM_POWERCLR_S0RETENTION_Pos) /*!< Bit mask of S0RETENTION field. */
#define VMC_RAM_POWERCLR_S0RETENTION_Off (1UL) /*!< Off */

/* Bit 1 : Keep RAM section S1 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S1POWER_Pos (1UL) /*!< Position of S1POWER field. */
#define VMC_RAM_POWERCLR_S1POWER_Msk (0x1UL << VMC_RAM_POWERCLR_S1POWER_Pos) /*!< Bit mask of S1POWER field. */
#define VMC_RAM_POWERCLR_S1POWER_Off (1UL) /*!< Off */

/* Bit 0 : Keep RAM section S0 of RAM[n] on or off in System ON mode */
#define VMC_RAM_POWERCLR_S0POWER_Pos (0UL) /*!< Position of S0POWER field. */
#define VMC_RAM_POWERCLR_S0POWER_Msk (0x1UL << VMC_RAM_POWERCLR_S0POWER_Pos) /*!< Bit mask of S0POWER field. */
#define VMC_RAM_POWERCLR_S0POWER_Off (1UL) /*!< Off */


/* Peripheral: WDT */
/* Description: Watchdog Timer */

/* Register: WDT_TASKS_START */
/* Description: Start the watchdog */

/* Bit 0 : Start the watchdog */
#define WDT_TASKS_START_TASKS_START_Pos (0UL) /*!< Position of TASKS_START field. */
#define WDT_TASKS_START_TASKS_START_Msk (0x1UL << WDT_TASKS_START_TASKS_START_Pos) /*!< Bit mask of TASKS_START field. */
#define WDT_TASKS_START_TASKS_START_Trigger (1UL) /*!< Trigger task */

/* Register: WDT_TASKS_STOP */
/* Description: Stop the watchdog timer. */

/* Bit 0 : Stop the watchdog timer. */
#define WDT_TASKS_STOP_TASKS_STOP_Pos (0UL) /*!< Position of TASKS_STOP field. */
#define WDT_TASKS_STOP_TASKS_STOP_Msk (0x1UL << WDT_TASKS_STOP_TASKS_STOP_Pos) /*!< Bit mask of TASKS_STOP field. */
#define WDT_TASKS_STOP_TASKS_STOP_Trigger (1UL) /*!< Trigger task */

/* Register: WDT_SUBSCRIBE_START */
/* Description: Subscribe configuration for task START */

/* Bit 31 :   */
#define WDT_SUBSCRIBE_START_EN_Pos (31UL) /*!< Position of EN field. */
#define WDT_SUBSCRIBE_START_EN_Msk (0x1UL << WDT_SUBSCRIBE_START_EN_Pos) /*!< Bit mask of EN field. */
#define WDT_SUBSCRIBE_START_EN_Disabled (0UL) /*!< Disable subscription */
#define WDT_SUBSCRIBE_START_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task START will subscribe to */
#define WDT_SUBSCRIBE_START_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define WDT_SUBSCRIBE_START_CHIDX_Msk (0xFFUL << WDT_SUBSCRIBE_START_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

/* Register: WDT_SUBSCRIBE_STOP */
/* Description: Subscribe configuration for task STOP */

/* Bit 31 :   */
#define WDT_SUBSCRIBE_STOP_EN_Pos (31UL) /*!< Position of EN field. */
#define WDT_SUBSCRIBE_STOP_EN_Msk (0x1UL << WDT_SUBSCRIBE_STOP_EN_Pos) /*!< Bit mask of EN field. */
#define WDT_SUBSCRIBE_STOP_EN_Disabled (0UL) /*!< Disable subscription */
#define WDT_SUBSCRIBE_STOP_EN_Enabled (1UL) /*!< Enable subscription */

/* Bits 7..0 : DPPI channel that task STOP will subscribe to */
#define WDT_SUBSCRIBE_STOP_CHIDX_Pos (0UL) /*!< Position of CHIDX field. */
#define WDT_SUBSCRIBE_STOP_CHIDX_Msk (0xFFUL << WDT_SUBSCRIBE_STOP_CHIDX_Pos) /*!< Bit mask of CHIDX field. */

